import type { Lesson } from '../../types';

export const chapter1: Lesson = {
    id: 'chapter-1',
    title: 'Κεφάλαιο 1',
    status: 'locked',
    image: '/src/assets/signs/city-start.svg', // Placeholder
    questions: [
        {
            "id": "q-1",
            "type": "multiple-choice",
            "prompt": "Οδηγώντας το αυτοκίνητό σας με σχάρα στην οροφή, ακόμα και χωρίς φορτίο:",
            "options": [
                "Αυξάνεται η κατανάλωση καυσίμου",
                "Μειώνεται η κατανάλωση καυσίμου",
                "Δεν επηρεάζεται η κατανάλωση καυσίμου"
            ],
            "correctAnswer": "Αυξάνεται η κατανάλωση καυσίμου"
        },
        {
            "id": "q-2",
            "type": "multiple-choice",
            "prompt": "Πότε έχετε αυξημένη κατανάλωση καυσίμου;",
            "options": [
                "Με ανοικτά παράθυρα",
                "Με κλειστά παράθυρα",
                "Με κλειστή ηλιοροφή"
            ],
            "correctAnswer": "Με ανοικτά παράθυρα"
        },
        {
            "id": "q-4",
            "type": "multiple-choice",
            "prompt": "Έχετε ένα αυτοκίνητο νέας τεχνολογίας και κατεβαίνετε κατηφόρα. Πότε θα καταναλώσετε λιγότερο καύσιμο;",
            "options": [
                "Αφήνοντας το γκάζι και έχοντας επιλέξει την κατάλληλη σχέση στο κιβώτιο ταχυτήτων",
                "Βάζοντας τον μοχλό ταχυτήτων στη θέση «νεκρά»",
                "Επιλέγοντας την πρώτη σχέση στο κιβώτιο πατώντας ελαφρά το γκάζι"
            ],
            "correctAnswer": "Αφήνοντας το γκάζι και έχοντας επιλέξει την κατάλληλη σχέση στο κιβώτιο ταχυτήτων"
        },
        {
            "id": "q-5",
            "type": "multiple-choice",
            "prompt": "Οικονομική οδήγηση επιτυγχάνεται:",
            "options": [
                "Με μειωμένη πίεση των ελαστικών",
                "Με την οδήγηση σε αυξημένες στροφές του κινητήρα",
                "Με τη σωστή πίεση των ελαστικών"
            ],
            "correctAnswer": "Με τη σωστή πίεση των ελαστικών"
        },
        {
            "id": "q-7",
            "type": "multiple-choice",
            "prompt": "Ο θόρυβος που προκαλείται από τα αυτοκίνητα:",
            "options": [
                "Μειώνεται όταν επιταχύνετε",
                "Μειώνεται αν έχει καθαριστεί ο κινητήρας σας",
                "Μπορεί να μειωθεί με σωστή οδήγηση, αποφεύγοντας απότομα φρεναρίσματα και επιταχύνσεις"
            ],
            "correctAnswer": "Μπορεί να μειωθεί με σωστή οδήγηση, αποφεύγοντας απότομα φρεναρίσματα και επιταχύνσεις"
        },
        {
            "id": "q-9",
            "type": "multiple-choice",
            "prompt": "Η ρύπανση που προκαλείται από τα οχήματα με βενζινοκινητήρα:",
            "options": [
                "Μπορεί να οφείλεται σε κακή ρύθμιση της ανάφλεξης",
                "Δεν εξαρτάται από τις ρυθμίσεις του κινητήρα",
                "Δεν εξαρτάται από την ύπαρξη μολύβδου στη βενζίνη"
            ],
            "correctAnswer": "Μπορεί να οφείλεται σε κακή ρύθμιση της ανάφλεξης"
        },
        {
            "id": "q-10",
            "type": "multiple-choice",
            "prompt": "Για να μειωθεί η μόλυνση του αέρα που προκαλείται από την κυκλοφορία των βενζινοκίνητων οχημάτων, πρέπει:",
            "options": [
                "Να ελέγχετε συχνά το σύστημα μετάδοσης",
                "Να αποφεύγετε την παρατεταμένη χρήση χαμηλών σχέσεων μετάδοσης",
                "Να πατάτε το γκάζι επαναλαμβανόμενα σταματημένοι για να κρατήσετε ζεστό τον κινητήρα και να βελτιώσετε την απόδοσή του"
            ],
            "correctAnswer": "Να αποφεύγετε την παρατεταμένη χρήση χαμηλών σχέσεων μετάδοσης"
        },
        {
            "id": "q-11",
            "type": "multiple-choice",
            "prompt": "Η ατμοσφαιρική ρύπανση που προκαλείται από πετρελαιοκίνητα οχήματα:",
            "options": [
                "Εξαρτάται από τον τύπο του υγρού για το ψυγείο",
                "Εξαφανίζεται εντελώς επιταχύνοντας",
                "Αυξάνεται εάν υπάρχει βλάβη στο σύστημα τροφοδοσίας"
            ],
            "correctAnswer": "Αυξάνεται εάν υπάρχει βλάβη στο σύστημα τροφοδοσίας"
        },
        {
            "id": "q-12",
            "type": "multiple-choice",
            "prompt": "Για να αποφεύγετε τις εκπομπές θορύβων κατά τη διάρκεια της κυκλοφορίας, πρέπει:",
            "options": [
                "Κρατήστε τον κινητήρα σε κίνηση, πατώντας το γκάζι επαναλαμβανόμενα όταν σταματάτε εξαιτίας του κυκλοφοριακού",
                "Να χρησιμοποιείτε την κόρνα για να ειδοποιήσετε τους άλλους χρήστες, μόνο αν σε περιπτώσεις κυκλοφοριακής συμφόρησης",
                "Να αποφεύγετε να φρενάρετε απότομα, εάν δεν είναι απολύτως απαραίτητο"
            ],
            "correctAnswer": "Να αποφεύγετε να φρενάρετε απότομα, εάν δεν είναι απολύτως απαραίτητο"
        },
        {
            "id": "q-13",
            "type": "multiple-choice",
            "prompt": "Για να μειώσετε τον θόρυβο των μηχανοκίνητων οχημάτων είναι απαραίτητο:",
            "options": [
                "Να τροποποιήσετε τον σιγαστήρα, έτσι ώστε να βελτιώνει τις επιδόσεις του κινητήρα",
                "Να αποφεύγετε να πατάτε γκάζι όταν το όχημα είναι σταματημένο",
                "Να αφαιρέσετε τον σιγαστήρα, ώστε να βελτιώσετε την απόδοση του κινητήρα"
            ],
            "correctAnswer": "Να αποφεύγετε να πατάτε γκάζι όταν το όχημα είναι σταματημένο"
        }
    ]
};
